# RebarUpdateService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..RebarUpdateService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
Autodesk Internal: The service for updating rebar freeform elements
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId RebarUpdateService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarUpdateService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ RebarUpdateService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace